<!Doctype html>
<html>
<head>
    <title>
    Willkommen auf meiner Website
    </title>
    <link rel="stylesheet" type="text/css" href="style/tag2_demo.css"/>

    <!-- Bildergallerie -->
    <script src="js/bilder.js"></script>
    <script src="js/name.js"></script>

    <!-- LeafletJS -->
    <link rel="stylesheet" href="http://cdn.leafletjs.com/leaflet-0.7.3/leaflet.css" />
    <script src="http://cdn.leafletjs.com/leaflet-0.7.3/leaflet.js"></script>

    <script src="js/plugins/headroom.min.js"></script>
    <script src="js/headroom.js"></script>
</head>
<body>
    <div class="menu">
        <div class="helper_menu">Uff hier muss noch was cooles hin. Vielleicht Links zu FB, YT, Twitter, Flickr?</div>
    </div>
    <div class="container">
        <h1>
           Tag 2
        </h1>
        <p>
        	<h2> Javascript </h2>
   			<h3>Was ist Javascript &uuml;berhaupt? </h3>
		       Javascript ist wie der Name schon sagt eine Skriptspache, das hei&szlig;t in  etwa eine Sprache die f&uuml;r kurze kleine
		       Programme gedacht ist.
		   	<h3>Wozu braucht man Javascript? </h3>
		   	   Das meiste im Internet, das sich bewegt oder mit dem ihr interagien k&ouml;nnt ist in Javascript geschrieben.

            <h3>Was ist wichtig?</h3>
            	<h4> Variablen: </h4>
            	<p>
            	Variablen sind sowas wie Beh&auml;lter f&uuml;r Werte, zum Beispiel f&uuml;r Zahlen oder W&ouml;rter.
            	Durch das Schl&uuml;sselwort <strong style="color:#D24D57"> var </strong> legt man die folgende Zeichenkette als Variable fest.
            	Der Term <strong style="color:#D24D57"> var </strong> <strong> number </strong> bedeutet also,
            	dass <strong> number </strong> eine Variable ist.
            	</p>

            	<p id="demo">Mein Name ist:</p>

            	<button onclick="show()">Show name </button>

            	<p>
            	Variablen kann man auch Werte zuweisen, das funktioniert mit dem <strong> = </strong> Operator. Der Term
            	<strong style="color:#D24D57"> var </strong> <strong> number = 7;</strong> bedeutet also,
            	 dass number eine Variable mit dem Wert 7 ist. Werte von Variablen sind aber im Allgemeinen nicht endg&uuml;ltig man
            	 lann also <strong> number </strong> in der n&auml;chsten Zeile auch den Wert 8 zuweisen, mit dem Ausdruck
            	 <strong> number = 8;</strong>.
            	 </p>

            	 <button onclick="change()">Change name </button>

            	<h4> If-Abfragen </h4>
            	<p>
            	 If-Abfragen f&uuml;hren einen Teil Code aus falls eine Bedingung zutrifft.
            	 <strong style="color:#D24D57"> if </strong> <strong style="color:#26A65B"> (number > 7) </strong> <strong> {...}</strong>
            	 f&uuml;hrt also den Code in den Klammern genau dann aus, wenn die Variable number gr&ouml;&szlig;er als 7 ist.
            	 </p>
            	 <p>
            	 If-Abfragen lassen sich auch mit einem Else- Block verbinden. Dieser Else Block wird dann ausgef&uuml;hrt, wenn die Bedingung
            	 bei der If-Abfrage nicht erf&uuml;llt wurde.

            	 </p>
            	 <button onclick="kitty(); return false;">Magst du Katzen?</button>
            	 <img  id=cat src=http://bit.ly/1OVjZrb style="height:400px;">

            	 <h4>Schleifen </h4>
            	 <p>
            	 Schleifen benutzt man dann, wenn man ein St&uuml;ck Code mehrmals ausf&uuml;hren m&ouml;chte. Es gibt verschiede Arten von Schleifen
            	 aber f&uuml;r die meisten F&auml;lle reicht eine for-Schleife. Die Schleife hat eine Laufvariable, die meistens
            	 <stron> i </strong> genannt wird. In jedem Schleifendurchlauf wird i erh&ouml;ht, erreicht i einen bestimmten Wert bricht
            	 die Schleife ab und der Code der hinter der Schleife steht wird ausgef&uuml;hrt.  Die Syntax f&uuml;r eine solche for-Schleifen,
            	 die abbricht wenn i=10 ist, ist:
            	 </p>
            	 <p>
            	 <strong style="color:#D24D57"> for </strong>
            	  <strong style="color:#26A65B"> (var i = 0; i <= 10; i++) </strong> <strong> {...}</strong>
            	  </p>


            	  <button onclick = "calc();return false;"> Summe von 1 bis 100? </button>
            	  <p> Das Ergebnis ist: </p>
            	  <p id=sum> </p>



            	 <h4> Funktionen </h4>
            	 <p>
            	 Funktionen sind Codeabschnitte, das wesentliche an ihnen ist, dass man ihnen Parameter &uuml;bergeben kann und sie ein Ergebnis
            	 zur&uuml;ckgeben k&ouml;nnen. Eine einfache Funktion w&auml;re zum Beispiel: </p>
            	 <p> <strong style="color:#D24D57"> function </strong>  <strong> add </strong>
            	 <strong style="color:#26A65B"> (num1, num2) </strong> <strong> {</strong>  <strong style="color:#0066FF"> 	return </strong><strong> num1 + num2; }</strong> </p>
            	 Diese Funktion add &uuml;bernimmt zwei Variablen num1 und num2 als &uuml;bergabeparameter und gibt ihre Summe zur&uuml;ck.

            	<h4> Funktionsaufrufe </h4>
				<p> Die Funktionen die wir gerade kennengelernt haben muss man auch aufrufen. Diese Aufrufe verkn&uuml;pft man bei der
				Entwicklung von Webanwendungen meistens mit sogenannten Events. Zum Beispiel ist ein Mausclick ein solches Event.
				hat man zum Beispiel einen Button designed m&ouml;chte und m&ouml;chte man das beim klicken auf diesen Button die Funktion
				<strong>next()</strong> aufgerufen wird, so sieht der zugeh&ouml;rige Code wie Folgt aus: </p>
				<p><strong>&lt;div </strong><strong style="color:#D24D57"> onclick</strong><strong>=</strong>
				<strong style="color:#26A65B"> &quot;next()&quot;</strong> <strong>&gt;next&lt;/div&gt;</strong></p>

				<h4> Arrays </h4>
				<p>
				Arrays sind eine Art Tabelle in der viele Daten  liegen, also zum Beipiel viele Zahlen oder W&ouml;rter.
				Anlegen lassen sich Arrays &auml;hnlich zu anderen Variablen:
				</p>
				<p><strong style="color:#D24D57"> var </strong> <strong> numbers = [7,2,4,5];</strong> </p>
				<p> Hier wird ein Array mit 4 Zahlen angelegt.
				 Solange man die einzelnen Elemente im Array nicht ver&auml;ndert bleiben sie und ihre Reihenfolge gleich.
				Auf ein Element innerhalb eines Arrays l&auml;sst sicht wie folgt zugreifen: </p>
				<p><strong style="color:#D24D57"> numbers[0] </strong> <strong> = 1;</strong> </p>
				Dieser Ausdruck setzt den ersten Eintrag des Arrays <strong>numbers</strong> auf 1. Es sieht nun also so aus:
				<strong>[1,2,4,5]</strong>. Dabei muss man beachten, dass man bei Arrays mit 0 anf&auml;ngt zu z&auml;hlen,
				das erste Element hat also den Index 0.</p>
				<p> Man kann auch die L&auml;nge eines Arrays mit folgendem Befehl abfragen:</p>
				<p><strong> numbers</strong><strong style="color:#D24D57">.length</strong> </p>
				<p>Dieser Befehl w&uuml;rde in unserem Beispiel 4 zur&uuml;ckgeben, da vier Elemente im Array liegen.</p>

				<button onclick=getelem()> Arrayelemente </button>
				<p id=elem> </p>
        <h3>
            Erste App: Bildergalerie
        </h3>
        <p>
            <a href="#" onclick="next(); return false">Next</a>
            <a href="#" onclick="previous(); return false;">Back</a>
        </p>
        <img id="gallery" src="https://farm8.staticflickr.com/7140/7065590393_b38f545ab3_c.jpg" style="width:700px;">

    </div>
</body>
</html>
